---
type: WorksetPreview
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# WorksetPreview

`Autodesk.Revit.DB.WorksetPreview` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Id | 2014 | `public WorksetId Id { get ; }` |
| Property | IsDefaultWorkset | 2014 | `public bool IsDefaultWorkset { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2014 | `public string Name { get ; }` |
| Property | Owner | 2014 | `public string Owner { get ; }` |
| Property | UniqueId | 2014 | `public Guid UniqueId { get ; }` |